Repository: pypi-data/pypi-mirror-322
Catalog: packages/pyams-security/pyams_security-2.6.3-py3-none-any.whl/pyams_security/locales/*/LC_MESSAGES/pyams_security.po
Languages: fr

source: < unknown principal >
fr: < utilisateur inconnu >

source: View public contents
fr: Voir les contenus publics

source: View protected contents
fr: Voir les contenus protégés

source: Manage contents properties
fr: Gérer les contenus

source: View management screens
fr: Accéder à l'interface d'administration

source: Manage system properties
fr: Gérer le système

source: Manage security
fr: Gérer la sécurité

source: Manage roles
fr: Gérer les rôles

source: Use internal API
fr: Utiliser les API internes

source: Use public API
fr: Utiliser les API publiques

source: System manager (role)
fr: Administrateur (rôle)

source: System viewer (role)
fr: Invité (rôle)

source: Private API user (role)
fr: Utilisateur d'une API interne (rôle)

source: Public API user (role)
fr: Utilisateur d'une API publique (rôle)

source: User login
fr: Code utilisateur

source: Plug-in prefix
fr: Préfixe du module

source: This prefix is mainly used by authentication plug-ins to mark principals
fr: Ce préfixe est utilisé par les modules d'authentification pour identifier les utilisateurs

source: Plug-in title
fr: Libellé du module

source: Enabled plug-in?
fr: Module actif ?

source: You can choose to disable any plug-in...
fr: Un module inactif ne peut plus être utilisé pour authentifier ou rechercher les utilisateurs...

source: System authentication plug-in
fr: Utilisateur système

source: Admin. login
fr: Code utilisateur

source: Admin. password
fr: Mot de passe

source: Users folder plug-in
fr: Dossier d'utilisateurs

source: Use case insensitive login
fr: Identifiants insensibles à la casse

source: If enabled, users login will not be case sensitive
fr: Activez cette option pour rendre l'identifiant de connexion des utilisateurs insensible à la casse minuscules/majuscules

source: Your password must contain at least three of these kinds of characters: lowercase letters, uppercase letters, numbers and special characters
fr: Votre mot de passe doit contenir au moins trois de ces types de caractères : minuscules, majuscules, chiffres et autres caractères

source: If you don't provide a custom login, your login will be your email address...
fr: Si vous n'indiquez pas de code utilisateur, vous pourrez utiliser votre adresse de messagerie pour vous connecter...

source: E-mail address
fr: Adresse de messagerie

source: An email will be sent to this address to validate account activation; it will be used as your future user login
fr: Un message sera envoyé à cette adresse, contenant un lien pour vous permettre de la confirmer et d'activer votre compte ; elle pourra être utilisée comme identifiant de connexion si vous n'avez pas indiqué de code utilisateur

source: Your email address is not valid!
fr: Votre adresse de messagerie est incorrecte !

source: First name
fr: Prénom

source: Last name
fr: Nom

source: Company name
fr: Société

source: Password
fr: Mot de passe

source: Password must be at least 8 characters long, and contain at least three kinds of characters between lowercase letters, uppercase letters, numbers and special characters
fr: Le mot de passe doit être composé d'au moins huit caractères, et contenir au moins trois types de caractères parmi les lettres minuscules, les lettres majuscules, les chiffres et les caractères spéciaux

source: Confirmed password
fr: Confirmation du mot de passe

source: You didn't confirmed your password correctly!
fr: Vous n'avez pas confirmé votre mot de passe correctement !

source: Activation hash
fr: Clé d'activation

source: User email address
fr: Adresse de messagerie

source: Given email address is not valid!
fr: L'adresse de messagerie indiquée est incorrecte !

source: Password manager name
fr: Gestionnaire de mots de passe

source: Utility used to encrypt user password
fr: Utilitaire utilisé pour le cryptage des mots de passe

source: Wait confirmation?
fr: Attendre la confirmation ?

source: If 'no', user will be activated immediately without waiting email confirmation
fr: Si 'non', ce compte utilisateur sera activé immédiatement, sans attendre sa confirmation

source: You can't activate an account without setting a password!
fr: Vous ne pouvez pas activer un profil sans mot de passe!

source: Self-registered profile?
fr: Profil auto-enregistré ?

source: Activation secret key
fr: Clé secrète

source: This private secret is used to create and check activation hash
fr: Cette clé secrète est utilisée pour créer et vérifier la clé d'activation

source: This hash is provided into activation message URL. Activation hash is missing for local users which were registered without waiting their confirmation.
fr: Cette clé d'activation est fournie dans le message de confirmation de l'inscription ; elle n'est pas définie pour les utilisateurs pour lesquels l'attente de confirmation n'a pas été demandée

source: Activated
fr: Activé

source: Activation date
fr: Date d'activation

source: Password reset hash
fr: Hash de reset

source: This hash is provided when a user is asking for a password reset; please note that password reset request should not update password...
fr: Cette clé de hashage est définie lorsqu'un utilisateur demande une réinitialisation de son mot de passe ; cette demande de réinitialisation n'invalide pas l'ancien mot de passe...

source: Password reset hash date
fr: Date de reset

source: Groups folder plug-in
fr: Dossier de groupes

source: Group ID
fr: ID du groupe

source: This ID should be unique between all groups
fr: Cet ID doit être unique entre tous les groupes

source: Title
fr: Nom

source: Public label of this group
fr: Libellé public de ce groupe

source: Group principals
fr: Mandataires du groupe

source: IDs of principals contained in this group
fr: Liste des mandataires présents dans ce groupe ; ces mandataires peuvent être des utilisateurs, mais également d'autres groupes

source: Check request origin
fr: Contrôler l'origine des requêtes

source: If enabled, REST API will check requests against currently allowed origins, and raise an HTTP forbidden exception if not allowed
fr: Lorsque cette option est activée, les API REST peuvent vérifier l'origine des requêtes vis-à-vis des origines autorisées, et lever une exception lorsqu'une requête est émise depuis une origine non autorisée

source: Allowed origins
fr: Origines autorisées

source: List of allowed origins URLs using CORS requests
fr: Liste des URLs d'origine autorisées pour les requêtes CORS

source: Profile's avatar
fr: Image du profil

source: This picture will be associated to your user profile
fr: Cette image sera associée à votre profil utilisateur

source: Credentials plug-ins
fr: Modules d'identification

source: These plug-ins are used to extract credentials from an incoming request (the Pyramid session plug-in is built-in!). They can rely on authentication plug-ins to ensure that provided credentials are valid...
fr: Ces modules sont utilisés pour extraire les accréditations d'une requête (le module de prise en charge des sessions étant intégré). Ils peuvent s'appuyer sur les modules d'authentification pour s'assurer que ces accréditations sont valides !

source: Authentication plug-ins
fr: Modules d'authentification

source: The plug-ins can be used to check extracted credentials against a local or remote users database
fr: Ces modules peuvent être utilisés pour authentifier une requête en vérifiant les éléments d'identification vis à vis d'une base d'utilisateurs locale ou distante

source: Directory plug-ins
fr: Modules d'annuaires

source: The plug-in can be used to extract principals information
fr: Ces modules peuvent être utilisés pour rechercher des mandataires

source: Access menu from home
fr: Ajouter un accès depuis l'accueil

source: If 'yes', a menu will be displayed to get access to security manager from site admin home page
fr: Si 'oui', un menu d'accès au gestionnaire de sécurité sera ajouté depuis la page d'accueil de l'interface d'acministration du site

source: Inherit parent security?
fr: Héritage de la sécurité ?

source: Get access control entries (ACE) inherited from parent levels
fr: Combiner les règles de contrôle d'accès (ACE) définies localement avec celles héritées du parent

source: Public denied permissions
fr: Permissions publiques retirées

source: These permissions will be denied to all users. Denied permissions take precedence over granted ones.
fr: Ces permissions seront retirées aux utilisateurs non authentifiés ; les permissions retirées sont prioritaires par rapport aux permissions accordées

source: Public granted permissions
fr: Permissions publiques accordées

source: These permissions will be granted to all users
fr: Ces permissions seront accordées à tous les utilisateurs

source: Authenticated denied permissions
fr: Permissions authentifiées retirées

source: These permissions will be denied to authenticated users. Denied permissions take precedence over granted ones.
fr: Ces permissions seront retirées aux utilisateurs authentifiés ; les permissions retirées sont prioritaires par rapport aux permissions accordées

source: Authenticated granted permissions
fr: Permissions authentifiées accordées

source: These permissions will be granted to authenticated users
fr: Ces permissions seront accordées aux utilisateurs authentifiés

source: Inherit parent roles?
fr: Héritage des rôles ?

source: Get roles granted on parent levels
fr: Hériter des rôles affectés aux niveaux parents

source: Internal API
fr: API internes

source: These principals are allowed to access internal API
fr: Les détenteurs de ce rôle sont habilités à accéder aux API internes

source: Public API
fr: API publiques

source: These principals are allowed to access public API
fr: Les détenteurs de ce rôle sont habilités à accéder aux API publiques

source: Site managers
fr: Administrateurs

source: These principals are allowed to manage the whole application environment
fr: Les détenteurs de ce rôle sont habilités à gérer tous les paramètres de l'application

source: Site viewers
fr: Invités

source: These principals are allowed to view some application settings, without update
fr: Les détenteurs de ce rôle peuvent accéder à certains écrans de l'interface d'administration, mais sans droit de mise à jour

source: Enable notifications?
fr: Activer les notifications ?

source: If 'no', mail notifications will be disabled
fr: Si 'non', les messages de notification ne seront pas activés

source: Mailer utility
fr: Serveur de messagerie

source: Mail delivery utility used to send notifications
fr: Serveur de messagerie utilisé pour l'envoi des notifications

source: Notifications can't be enabled without mailer utility
fr: Les notifications ne peuvent pas être activés sans sélection d'un serveur de messagerie

source: Service name
fr: Nom du service

source: Name of service as defined in registration mail subject
fr: Ce nom sera inscrit dans le sujet des messages de notification

source: Service owner
fr: Propriétaire du service

source: Name of the entity providing this service, which will be visible in notifications messages
fr: Nom du service ou de l'entité fournissant ce service, qui sera indiqué dans les messages de notification

source: Sender name
fr: Nom d'expéditeur

source: Visible name of registration mail sender
fr: Nom de l'expéditeur indiqué dans les messages de notification

source: Sender email
fr: Adresse de l'expéditeur

source: Email address of registration mail sender
fr: Nom de l'adresse d'expédition des messages de notification

source: Subject prefix
fr: Préfixe des sujets

source: This prefix will be inserted into subject prefix of each notification message
fr: Ce préfixe sera inséré en tête du sujet des messages de notification

source: Confirmation template
fr: Message de confirmation

source: This template will be used instead of default template to send notification when a user is registered by a system administrator; you can use some user properties into the message body, like: {login}, {email}, {firstname}, {lastname}, {title} or {company_name}; message activation link and footer are added automatically
fr: S'il est renseigné, ce modèle sera utilisé en lieu et place du modèle par défaut pour l'envoi des notifications lorsqu'un utilisateur est inscrit par un administrateur ; vous pouvez utiliser certaines propriétés de l'utilisateur dans le corps du message, en les entourant avec des accolades : code utilisateur ({login}), adresse de messagerie ({email}), prénom ({firstname}), nom ({name}), titre ({title}) et société ({company_name}) ; le contenu du lien de confirmation ainsi que le pied du message seront ajoutés automatiquement

source: Registration template
fr: Message d'enregistrement

source: This template will be used instead of default template to send notificaiton when a user is auto-registered; you can use some user properties into the message body, like: {login}, {email}, {firstname}, {lastname}, {title} or {company_name}; message activation link and footer are added automatically
fr: S'il est renseigné, ce modèle sera utilisé en lieu et place du modèle par défaut pour l'envoi des notifications lorsqu'un utilisateur s'est auto-inscrit ; vous pouvez utiliser certaines propriétés de l'utilisateur dans le corps du message, en les entourant avec des accolades : code utilisateur ({login}), adresse de messagerie ({email}), prénom ({firstname}), nom ({name}), titre ({title}) et société ({company_name}) ; le contenu du lien de confirmation ainsi que le pied du message seront ajoutés automatiquement

source: Email signature
fr: Signature

source: Text displayed in email footer
fr: Ce texte sera affiché dans le pied des messages de notification

source: Internal request authentication
fr: Authentification des services internes

source: Please confirm registration
fr: Veuillez confirmer votre inscription

source: Password reset
fr: Réinitialisation du mot de passe

source: Can't activate profile with given params!
fr: Impossible de confirmer votre inscription avec les paramètres fournis !

source: Invalid reset request!
fr: Demande de réinitialisation invalide !

source: Can't reset password with given params!
fr: Impossible de réinitialiser votre mot de passe avec les paramètres fournis !

source: Your password reset hash is no longer valid!
fr: Votre lien de réinitialisation du mot de passe n'est plus valide !

source: ${header} Password reset
fr: ${header} Réinitialisation de mot de passe

source: Hello,
fr: Bonjour,

source: ${service_name} is a service provided by ${service_owner}.
fr: ${service_name} est un service fourni par ${service_owner}

source: A password reset has been requested for your account: ${login}.
fr: Une demande de réinitialisation du mot de passe a été effectuée pour votre compte : ${login}.

source: If you want to confirm this action, please click on the following link, re-enter your login and set a new password:
fr: Pour confirmer cette demande de réintialisation, veuillez cliquer sur le lien ci-dessous, indiquer votre identifiant de connexion et fournir un nouveau mot de passe.

source: This link is only valid during 7 days. After this delay, you will have to do a new request to get another email with a new link.
fr: Ce lien n'est valide que pour une durée de 7 jours. Passé ce délai, vous devrez effectuer une nouvelle demande pour obtenir un nouveau lien de réinitialisation de votre mot de passe.

source: Thank you for using our services.
fr: Merci d'utiliser nos services.

source: ${header} Registration notice
fr: ${header} Inscription effectuée

source: To confirm your registration, please click on the following link, re-enter your login and set a new password:
fr: Pour confirmer cette inscription, veuillez cliquer sur le lien ci-dessous, indiquer votre identifiant de connexion et fournir un nouveau mot de passe.

source: If you don't want to confirm this registration, please just ignore this message and your registration information will be deleted within ${delay} days.
fr: Si vous ne souhaitez pas confirmer cette inscription, ou si celle-ci a été faite sans votre consentement, il vous suffit d'ignorer ce message et votre inscription sera supprimée automatiquement dans un délai de ${delay} jours.

source: You have registered a new account that you may confirm before being able to use the service.
fr: Vous avez enregistré un nouveau compte que vous devez confirmer avant de pouvoir utiliser ce service.

source: A new account has been created for your email address, that you may confirm before being able to use the service.
fr: Un nouveau compte utilisateur vient d'être créé pour votre adresse de messagerie, que vous devez confirmer avant de pouvoir utiliser ce service.

source: The login that was given to your account is: ${login}.
fr: L'identifiant de connexion qui a été fourni pour votre compte est : ${login}.
